# HostElementId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinkElementId..::..HostElementId Property
LinkElementId Class See Also
---
The id of the element in the host, or invalidElementId if there is a link.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ElementId HostElementId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HostElementId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ HostElementId {
	ElementId^ get ();
}
```

# See Also
LinkElementId Class
Autodesk.Revit.DB Namespace